//------------------------------------------------------------------------------

#ifndef PROTOCOL_HPP
#define PROTOCOL_HPP

//------------------------------------------------------------------------------

#include "Common_facilities.hpp"


//------------------------------------------------------------------------------
// Константы управляющих кодов фискального регистратора
constexpr size_t manage_code_count = 3;

enum class Mng_code {
    stx, ack, nak
};

constexpr std::array<Byte, manage_code_count> manage_codes {
    0x02, 0x06, 0x15
};

//------------------------------------------------------------------------------

enum class Imager_codes {
    send_image
};

//------------------------------------------------------------------------------

constexpr std::array<Byte, 1> imager_comand_codes {
    0xf1
};

//------------------------------------------------------------------------------

template<class T>
constexpr int to_int(T t)
{
    return static_cast<int>(t);
}

//------------------------------------------------------------------------------

#endif // PROTOCOL_HPP

//------------------------------------------------------------------------------
